export default function AboutPage() {
  return (
    <section>
      <h1>Про програму</h1>
      <h3>Сервіс поставок автомобілів.</h3>
      <p>
        Проєкт створено з навчальною метою для практики сучасної fullstack-розробки. Застосунок дозволяє працювати з каталогом автомобілів, переглядати детальну інформацію, виконувати пошук,
        фільтрацію та сортування, а також керувати записами залежно від ролі користувача. У проєкті реалізовано авторизацію, розмежування прав доступу, пагінацію та infinite scroll, роботу з
        пов’язаними сутностями брендів і власників, завантаження зображень та взаємодію frontend-частини з REST API.{" "}
      </p>
      <p>
        Основна мета проєкту — закріпити практичні навички побудови повноцінного клієнт-серверного застосунку: від структури бази даних і backend-логіки до React-інтерфейсу, обробки помилок, роботи з
        формами та розгортання застосунку.
      </p>
    </section>
  );
}